
// স্ট্রিং মেথড
// মেথড (Method)	বর্ণনা
// charAt()	সুনির্দিষ্ট ইনডেক্স এর (অবস্থান) নির্দিষ্ট বর্ণ ফেরত দেয়।
// charCodeAt()	সুনির্দিষ্ট ইনডেক্স এর নির্দিষ্ট ইউনিকোড বর্ণ ফেরত দেয়।
// concat()	দুই বা ততোধিক স্ট্রিং কে যুক্ত করে এবং তার একটি অনুলিপি ফেরত দেয়।
// fromCharCode()	ইউনিকোড মানকে বর্ণে পরিবর্তন করে।
// indexOf()	স্ট্রিং এর নির্দিষ্ট মান এর ভিতরে প্রথম পাওয়া কাঙ্খিত ঘটনা এর অবস্থান ফেরত দেয়।
// lastIndexOf()	স্ট্রিং এর নির্দিষ্ট মান এর ভিতরে শেষ পাওয়া কাঙ্খিত ঘটনা এর অবস্থান ফেরত দেয়।
// localeCompare()	বর্তমান অবস্থানের দুটি স্ট্রিং এর মধ্যে তুলনা করে।
// match()	রেগুলার এক্সপ্রেশন এর মধ্যে একটি স্ট্রিং কে খুঁজে এবং খুঁজে পাওয়া ফলাফল ফেরত দেয়।
// replace()	স্ট্রিং এর নির্দিষ্ট মান খোঁজে এবং নতুন একটি স্ট্রিং দ্বারা প্রতিস্থাপণ করে তা ফেরত দেয়।
// search()	স্ট্রিং এর নির্দিষ্ট মান খোঁজে এবং এর অবস্থান ফেরত দেয়।
// slice()	স্ট্রিং এর সার অংশ বের করে এবং নতুন একটি স্ট্রিং ফেরত দেয়। 
// split()	স্ট্রিং কে বিভাজন করে সাবস্ট্রিং এর অ্যারে তৈরি করে।
// substr()	স্ট্রিং এর নির্দিষ্ট অংশ এর সার অংশ বের করে কিছুসংখ্যক বর্ণের মাধ্যমে।
// substring()	দুইটি নির্দিষ্ট অবস্থান এর মধ্যে একটি স্ট্রিং এর নির্দিষ্ট অংশ এক্সট্রাক্ট করে।
// toLocaleLowerCase()	স্ট্রিং কে ছোট হাতের অক্ষরে পরিণত কর। 
// toLocaleUpperCase()	স্ট্রিং কে বড় হাতের অক্ষরে পরিণত করে।
// toLowerCase()	স্ট্রিং কে ছোট হাতের অক্ষরে পরিণত কর।
// toString()	স্ট্রিং অবজেক্ট এর মান ফেরত দেয়। 
// toUpperCase()	স্ট্রিং কে বড় হাতের অক্ষরে পরিণত করে।
// trim()	স্ট্রিং এর উভয় প্রান্ত থেকে ফাঁকা স্পেস মুছে ফেলে।
// valueOf()	স্ট্রিং অবজেক্ট এর আদি মান ফেরত দেয়। 